cmsis-svd/cmsis-svd/data/SiliconLabs/Series1/BGM1/BGM111A256V2.svd
        <register>
          <name>CH10_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x5E307F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No source selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSL</name>
                  <description>Peripheral Reflex System</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSH</name>
                  <description>Peripheral Reflex System</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x0000001C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x0000001D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCC</name>
                  <description>Real-Time Counter and Calendar</description>
                  <value>0x00000029</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOL</name>
                  <description>General purpose Input/Output</description>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOH</name>
                  <description>General purpose Input/Output</description>
                  <value>0x00000031</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LETIMER0</name>
                  <description>Low Energy Timer 0</description>
                  <value>0x00000034</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCNT0</name>
                  <description>Pulse Counter 0</description>
                  <value>0x00000036</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYOTIMER</name>
                  <description>CRYOTIMER</description>
                  <value>0x0000003C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMU</name>
                  <description>Clock Management Unit</description>
                  <value>0x0000003D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM4</name>
                  <value>0x00000043</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDSEL</name>
              <description>Edge Detect Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Signal is left as it is</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>A one HFCLK cycle pulse is generated for every positive edge of the incoming signal</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>A one HFCLK clock cycle pulse is generated for every negative edge of the incoming signal</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>A one HFCLK clock cycle pulse is generated for every edge of the incoming signal</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRETCH</name>
              <description>Stretch Channel Output</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV</name>
              <description>Invert Channel</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ORPREV</name>
              <description>Or Previous</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANDNEXT</name>
              <description>And Next</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASYNC</name>
              <description>Asynchronous Reflex</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH11_CTRL</name>
          <description>Channel Control Register</description>
          <addressOffset>0x06C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x5E307F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No source selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSL</name>
                  <description>Peripheral Reflex System</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSH</name>
                  <description>Peripheral Reflex System</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>Analog to Digital Converter 0</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 0</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>Universal Synchronous/Asynchronous Receiver/Transmitter 1</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0</name>
                  <description>Timer 0</description>
                  <value>0x0000001C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1</name>
                  <description>Timer 1</description>
                  <value>0x0000001D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCC</name>
                  <description>Real-Time Counter and Calendar</description>
                  <value>0x00000029</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOL</name>
                  <description>General purpose Input/Output</description>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOH</name>
                  <description>General purpose Input/Output</description>
                  <value>0x00000031</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LETIMER0</name>
                  <description>Low Energy Timer 0</description>
                  <value>0x00000034</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCNT0</name>
                  <description>Pulse Counter 0</description>
                  <value>0x00000036</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYOTIMER</name>
                  <description>CRYOTIMER</description>
                  <value>0x0000003C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMU</name>
                  <description>Clock Management Unit</description>
                  <value>0x0000003D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM4</name>
                  <value>0x00000043</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDSEL</name>
              <description>Edge Detect Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Signal is left as it is</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>A one HFCLK cycle pulse is generated for every positive edge of the incoming signal</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>A one HFCLK clock cycle pulse is generated for every negative edge of the incoming signal</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>A one HFCLK clock cycle pulse is generated for every edge of the incoming signal</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRETCH</name>
              <description>Stretch Channel Output</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV</name>
              <description>Invert Channel</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ORPREV</name>
              <description>Or Previous</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANDNEXT</name>
              <description>And Next</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASYNC</name>
              <description>Asynchronous Reflex</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
